{"config": [{"config": {"mask_value": -1, "name": "masking_1", "batch_input_shape": [null, 5, 8], "trainable": true, "dtype": "float32"}, "class_name": "Masking"}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "unroll": false, "use_bias": true, "implementation": 1, "stateful": false, "return_sequences": false, "bias_constraint": null, "recurrent_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "dropout": 0.2, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 32, "name": "lstm_1", "activation": "tanh", "bias_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "return_state": false, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 5, "name": "dense_1", "activation": "linear", "dtype": "float32", "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, 32]}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Sequential"}